app/controllers/articles_controller.rb

  def new
    @article = Article.new
    # Extra Credit question, you could have Article.create here and then redirect_to edit_article_path(@article) and you wouldn't need the "new" view at all.
  end
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-12-14 19:42:23.410753"], ["updated_at", "2020-12-14 19:42:23.410753"]]